# 1 задача

a = input("Введите первую цифру: ")
b = input("Введите вторую цифру: ")
c = input("Введите третью цифру: ")

number = a + b + c
print("Полученное число:", number)

# 2 задача

n = int(input("Введите четырёхзначное число: "))

d1 = n // 1000
d2 = (n // 100) % 10
d3 = (n // 10) % 10
d4 = n % 10

product = d1 * d2 * d3 * d4
print("Произведение цифр:", product)

# 3 задача

m = float(input("Введите метры: "))

c = m * 100
d = m * 10
w = m * 1000
m = m / 1609.34

print("Сантиметры:", c)
print("Дециметры:", d)
print("Миллиметры:", w)
print("Мили:", m)

# 4 задача

base = float(input("Введите основание: "))
h = float(input("Введите высоту: "))
a = 0.5 * base * h
print("Введите площадь:", a)

# 5 задача

n = int(input("Введите четырёхзначное число: "))

d1 = n // 1000
d2 = (n // 100) % 10
d3 = (n // 10) % 10
d4 = n % 10

num = d4 * 1000 + d3 * 100 + d2 * 10 + d1
print("Перевёрнутое число:", num)